DROP TABLE IF EXISTS `tbl_business_book`;

CREATE TABLE `tbl_business_book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `business_book_name` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

INSERT INTO `tbl_business_book` VALUES("1","SEA-QUEEN-SALLARY"),
("2","JAMAL-COMPUTER"),
("3","WOODLAND-SALARY"),
("4","কোর্ট বিল্ডিং- আয় বিবরণী"),
("5","Anisur Rahman\'s business");



DROP TABLE IF EXISTS `tbl_ledger_book_transections`;

CREATE TABLE `tbl_ledger_book_transections` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` text NOT NULL,
  `time` text NOT NULL,
  `description` text NOT NULL,
  `accounts_head` text NOT NULL,
  `cash_in` int(11) NOT NULL,
  `cash_out` int(11) NOT NULL,
  `tbl_ledger_books_id` int(11) NOT NULL,
  `party_name` text NOT NULL,
  `entry_by` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=370 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

INSERT INTO `tbl_ledger_book_transections` VALUES("262","03-Jul-25","8:45 PM","জুন-2025 এর মাসিক বেতন প্রদান","আয়-বেতন","15000","0","8","",""),
("263","04-Jul-25","11:43 AM","জয়াকে মাসিক প্রদান","খরচ-জয়া","0","500","8","",""),
("264","04-Jul-25","11:44 AM","দুধ- 50+ চানাচুর-50+আদা-25+রসুন-20","খরচ-বাজার","0","140","8","",""),
("265","04-Jul-25","11:45 AM","সকালের নাস্তা","খরচ-নাস্তা","0","65","8","",""),
("266","04-Jul-25","11:50 AM","ব্যাংক হতে উত্তোলন- ল্যাপটপের জন্য","আয়-অন্যান্য","3100","0","8","",""),
("267","04-Jul-25","11:51 AM","SMD REWORK STATION-2600+SOLDERING PASTE-100+TWIZZER-200+CUTTER-100","খরচ-অন্যান্য","0","3000","8","",""),
("268","04-Jul-25","12:25 PM","Market to home+ cream ban","খরচ-বাজার","0","100","8","",""),
("269","04-Jul-25","10:48 PM","বিস্কুট-","","0","55","8","",""),
("270","06-Jul-25","9:43 AM","","খরচ-ঘরভাড়া","0","6500","8","",""),
("271","06-Jul-25","9:44 AM","নাস্তা+গাড়ি ভাড়া+বাজার","","0","310","8","",""),
("272","06-Jul-25","10:47 AM","খাটের জন্য বেড ক্রয়","","0","1200","8","",""),
("273","06-Jul-25","10:48 AM","মুরগী ক্রয়","","0","265","8","",""),
("274","06-Jul-25","10:55 AM","","খরচ-যাতায়াত","0","40","8","",""),
("275","06-Jul-25","11:33 AM","পিয়াজ ৫৫ আলু ৪০","","0","95","8","",""),
("276","06-Jul-25","11:34 AM","ডিম মুরগির ১২০ ডিম কোয়েল ৮০","","0","200","8","",""),
("277","06-Jul-25","11:36 AM","দান","","0","5","8","",""),
("278","06-Jul-25","11:38 AM","বাজার","খরচ-বাজার","0","2370","8","",""),
("279","06-Jul-25","7:11 PM","খাতা","","0","70","8","",""),
("280","06-Jul-25","7:11 PM","আইসক্রিম","","0","80","8","",""),
("281","06-Jul-25","7:12 PM","দুধ","","0","50","8","",""),
("282","06-Jul-25","7:12 PM","গুড়া দুধ","","0","20","8","",""),
("283","06-Jul-25","7:13 PM","১১টার নাস্তা","","0","35","8","",""),
("284","07-Jul-25","7:39 PM","সকালের নাস্তা","","0","30","8","",""),
("285","07-Jul-25","7:39 PM","মুনতাহার নাস্তার খরচ","","0","20","8","",""),
("286","07-Jul-25","7:39 PM","10টার নাস্তা","","0","25","8","",""),
("287","07-Jul-25","7:40 PM","ইন্টারনেট বিল- জুলাই-২০২৫-600","","0","400","8","",""),
("288","07-Jul-25","7:40 PM","বাসা হতে অফিস","","0","35","8","",""),
("289","07-Jul-25","7:42 PM","সন্ধ্যার নাস্তা","","0","50","8","",""),
("290","08-Jul-25","12:06 PM","অফিস হতে বাসা","","0","35","8","",""),
("291","08-Jul-25","12:06 PM","আপেল+মাল্টা ক্রয়","","0","195","8","",""),
("292","08-Jul-25","12:06 PM","সকালের নাস্তা","","0","20","8","",""),
("293","08-Jul-25","12:43 PM","মুনতাহার নাস্তার","","0","10","8","",""),
("294","08-Jul-25","12:43 PM","দুধ ক্রয়","","0","45","8","",""),
("295","08-Jul-25","12:44 PM","আরবি খাতা","","0","20","8","",""),
("296","08-Jul-25","12:44 PM","মুনতাহার মাসিক বেতন","","0","1100","8","",""),
("297","08-Jul-25","12:59 PM","সবজি ক্রয়","","0","45","8","",""),
("298","08-Jul-25","1:00 PM","বাসা হতে অফিস","","0","45","8","",""),
("299","08-Jul-25","1:17 PM","বাজার খরচ","","0","45","8","",""),
("300","08-Jul-25","5:42 PM","চা+বেলপুরি","","0","45","8","",""),
("301","09-Jul-25","1:25 PM","অফিস হতে বাসা","","0","35","8","",""),
("302","09-Jul-25","1:25 PM","ফ্রোজেন-কফি-বাদাম-খেজুর-বন","","0","215","8","",""),
("303","09-Jul-25","1:27 PM","সকালের নাস্তা","","0","20","8","",""),
("304","09-Jul-25","1:27 PM","মুনতাহার নাস্তা","","0","10","8","",""),
("305","09-Jul-25","1:27 PM","বাসা হতে অফিস","","0","35","8","",""),
("306","09-Jul-25","1:28 PM","পিঠা ক্রয়","","0","30","8","",""),
("307","09-Jul-25","7:53 PM","দুপুরের চা","","0","10","8","",""),
("308","10-Jul-25","2:11 PM","অফিস হতে বাসা","","0","35","8","",""),
("309","10-Jul-25","2:11 PM","বন","","0","30","8","",""),
("310","10-Jul-25","2:11 PM","সকালের নাস্তা","","0","20","8","",""),
("311","10-Jul-25","2:11 PM","দুধ 50+ বিস্কুট 10","","0","60","8","",""),
("312","10-Jul-25","2:12 PM","মুনতাহা","","0","10","8","",""),
("313","10-Jul-25","2:12 PM","বাসা হতে অফিস","","0","35","8","",""),
("314","10-Jul-25","3:09 PM","কম্পিউটার সেটআপ হতে আয়","আয়-অন্যান্য","490","0","8","",""),
("315","10-Jul-25","3:10 PM","ছাতা মেরামত","","0","100","8","",""),
("316","10-Jul-25","3:10 PM","দুপুরের খাবার+চা","","0","85","8","",""),
("317","10-Jul-25","7:42 PM","চা","","0","25","8","",""),
("318","11-Jul-25","1:08 PM","Basa","","0","40","8","",""),
("319","11-Jul-25","1:08 PM","Pop corn","","0","20","8","",""),
("320","11-Jul-25","1:08 PM","Biscuits","","0","65","8","",""),
("321","11-Jul-25","1:09 PM","সকালের নাস্তা","","0","40","8","",""),
("322","11-Jul-25","1:09 PM","দান","","0","5","8","",""),
("323","11-Jul-25","1:10 PM","দান","","0","10","8","",""),
("324","11-Jul-25","9:09 PM","বেরিবাদ","","0","20","8","",""),
("325","11-Jul-25","9:09 PM","আচার","","0","10","8","",""),
("326","11-Jul-25","9:10 PM","বাদাম","","0","10","8","",""),
("327","11-Jul-25","9:13 PM","বাসা","","0","30","8","",""),
("328","12-Jul-25","8:01 PM","সকালের নাস্তা","","0","35","8","",""),
("329","12-Jul-25","8:01 PM","মুনতাহার নাস্তার খরচ","","0","10","8","",""),
("330","12-Jul-25","8:02 PM","বাসা হতে অফিস","","0","35","8","",""),
("331","12-Jul-25","8:07 PM","অন্যান্য আয়","","160","0","8","",""),
("332","13-Jul-25","4:43 AM","Nasta","","0","35","8","",""),
("333","13-Jul-25","4:44 AM","Basa","","0","45","8","",""),
("334","13-Jul-25","9:29 AM","সকালের নাস্তা","","0","30","8","",""),
("335","13-Jul-25","9:30 AM","মুনতাহা","","0","10","8","",""),
("336","13-Jul-25","9:30 AM","office","","0","55","8","",""),
("337","13-Jul-25","9:31 AM","জুতা সেলাই","","0","50","8","",""),
("338","13-Jul-25","9:32 AM","জয়া","","100","0","8","",""),
("339","13-Jul-25","7:39 PM","দুপুরের খাবার","","0","55","8","",""),
("340","13-Jul-25","8:04 PM","সন্ধ্যা নাস্তা","","0","30","8","",""),
("341","13-Jul-25","10:28 PM","বাসা","","0","35","8","",""),
("342","14-Jul-25","11:09 AM","দুধ-50+বিস্কুট-40","","0","100","8","",""),
("343","14-Jul-25","11:10 AM","সকালের নাস্তা+মুনতাহার নাস্তা","","0","40","8","",""),
("344","14-Jul-25","11:11 AM","বাসা হতে অফিস","","0","35","8","",""),
("345","14-Jul-25","11:11 AM","১০ টার নাস্তা","","0","15","8","",""),
("346","14-Jul-25","11:14 AM","সবজি ক্রয়","","0","40","8","",""),
("347","14-Jul-25","7:16 PM","দুপুরের খাবার","","0","75","8","",""),
("348","15-Jul-25","6:26 PM","ডাবল সাইড টেপ","","0","60","8","",""),
("349","15-Jul-25","6:26 PM","অফিস হতে বাসা","","0","35","8","",""),
("350","15-Jul-25","6:27 PM","সকালের নাস্তা","","0","30","8","",""),
("351","15-Jul-25","6:27 PM","১০টার নাস্তা","","0","10","8","",""),
("352","15-Jul-25","6:28 PM","বাসা হতে অফিস","","0","45","8","",""),
("353","15-Jul-25","6:29 PM","দুপুরের খাবার","","0","70","8","",""),
("354","15-Jul-25","9:48 PM","অফিস হতে বাসা","","0","50","8","",""),
("355","15-Jul-25","9:50 PM","জুন-২৫ এর মাদ্রাসার বেতন প্রদান","","4010","0","8","",""),
("356","15-Jul-25","9:50 PM","বিদ্যুৎ","","0","200","8","",""),
("357","16-Jul-25","11:33 AM","আইসক্রিম- ১ লিটার","","0","280","8","",""),
("358","16-Jul-25","11:33 AM","সকালের নাস্তা","","0","20","8","",""),
("359","16-Jul-25","11:33 AM","মুনতাহা+ জয়ার নাস্তা","","0","30","8","",""),
("360","16-Jul-25","11:34 AM","বাসা হতে অফিস","","0","50","8","",""),
("361","16-Jul-25","3:31 PM","দুপুরের খাবার","","0","100","8","",""),
("362","16-Jul-25","9:31 PM","মুরগি ক্রয়","","0","190","8","",""),
("363","16-Jul-25","9:31 PM","অফিস হতে বাসা","","0","35","8","",""),
("364","16-Jul-25","9:31 PM","সাবান","","0","75","8","",""),
("365","16-Jul-25","9:31 PM","বেলপুরি","","0","20","8","",""),
("366","16-Jul-25","9:34 PM","ঝাড়ু ক্রয়","","0","60","8","",""),
("367","16-Jul-25","9:35 PM","বিস্কুট","","0","20","8","",""),
("368","17-Jul-25","11:20 AM","সকালের নাস্তা","","0","30","8","",""),
("369","17-Jul-25","11:20 AM","বাসা হতে অফিস","","0","40","8","","");



DROP TABLE IF EXISTS `tbl_ledger_books`;

CREATE TABLE `tbl_ledger_books` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ledger_book_name` text NOT NULL,
  `tbl_business_book_id` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

INSERT INTO `tbl_ledger_books` VALUES("1","SALARY-NOVEMBER-2024","1"),
("2","SALARY-DECEMBER-2024","1"),
("3","SALARY-JANUARY-2025","1"),
("4","SALARY-FEBRUARY-2025","1"),
("5","SALARY-MARCH-2025","1"),
("6","SALARY-APRIL-2025","1"),
("7","SALARY-MAY-2025","1"),
("8","SALARY-JUNE-2025","1");



DROP TABLE IF EXISTS `tbl_transection_accounts_head`;

CREATE TABLE `tbl_transection_accounts_head` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `accounts_head_name` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;




